In [10]:
import pandas as pd 
import numpy as np

CREATING DATAFRAMES

In [11]:
#Making dataframe with Dictionary
data = {
    'Name': ['Rahul', 'Neha', 'Aman', 'Priya'],
    'Age': [25, 28, 24, 27],
    'City': ['Mumbai', 'Bengaluru', 'Pune', 'Hyderabad'],
    'Salary': [45000, 52000, 48000, 60000]
}
dF= pd.DataFrame(data)
dF

    Name  Age       City  Salary
0  Rahul   25     Mumbai   45000
1   Neha   28  Bengaluru   52000
2   Aman   24       Pune   48000
3  Priya   27  Hyderabad   60000

In [15]:
#Making dataframe with lists
data_list = [
    ['Karan', 30, 'Chennai', 70000],
    ['Anjali', 26, 'Jaipur', 42000],
    ['Rohit', 35, 'Ahmedabad', 85000],
    ['Sneha', 29, 'Indore', 50000]
]
dF2=pd.DataFrame(data_list)
#dF (This will print dataframe with  0 1 2 3 cols and so on)
# to insert cols in dataframe 
columns = ['Name', 'Age', 'City', 'Salary']
dF2= pd.DataFrame(data_list, columns=columns)
dF2

     Name  Age       City  Salary
0   Karan   30    Chennai   70000
1  Anjali   26     Jaipur   42000
2   Rohit   35  Ahmedabad   85000
3   Sneha   29     Indore   50000